Tekla Open API Reference for Tekla Structures 2025
ComponentItem.UIName Property
 The component item's name which is visible in the Tekla Structures user interface.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string UIName { get; set; }
Public Property UIName As String
	Get
	Set
Property Value
Type: String
See Also
Reference
ComponentItem Class
Tekla.Structures.Catalogs Namespace